## Introduction

In this lab assessment, you'll practice your knowledge of JOIN statements and subqueries, using various types of joins and various methods for specifying the links between them. One of the main benefits of using a relational database is the table relations that define them which allow you to access and connect data together via shared columns. By writing more advanced SQL queries that utilize joins and subqueries you can provide a deeper and more granular level of analysis and data retrieval.

This assessment will continue looking at the familiar Northwind database that contains customer relationship management (CRM) data as well as employee and product data. You will take a deeper dive into this database in order to accomplish more advanced SQL queries that require you to access data from multiple tables at once. 

Imagine that you are working in an analyst role for the sales rep team. They have collaborated with the customer relations and the product teams to take a comprehensive look at the employee to customer pipeline in an attempt to find areas of improvement and potential growth. You have been asked to provide some specific data and statistics regarding this project.

## Learning Objectives

You will be able to:

* Write SQL queries that make use of various types of joins
* Choose and perform whichever type of join is best for retrieving desired data
* Write subqueries to decompose complex queries

## Database

The database will be the customer relationship management (CRM) database, which has the following ERD.

![Database-Schema.png](ERD.png)

### Connect to the database

In the cell below we have provided the code to import both pandas and sqlite3 as well as define and create the connection to the database you will use. Also displayed is the schema and table names from the database. Use this information in conjunction with the ERD image above to assist in creating your SQL Queries.

Major Hint: Look for the shared columns across tables you need to 'join' together.

In [1]:
# CodeGrade step0
# Run this cell without changes

# SQL Library and Pandas Library
import sqlite3
import pandas as pd

# Connect to the database
conn = sqlite3.connect('data.sqlite')

pd.read_sql("""SELECT * FROM sqlite_master""", conn)

,type,name,tbl_name,rootpage,sql
0,table,orderdetails,orderdetails,2,"CREATE TABLE `orderdetails` (`orderNumber`, `p..."
1,table,payments,payments,28,"CREATE TABLE `payments` (`customerNumber`, `ch..."
2,table,offices,offices,32,"CREATE TABLE `offices` (`officeCode`, `city`, ..."
3,table,customers,customers,33,"CREATE TABLE `customers` (`customerNumber`, `c..."
4,table,orders,orders,38,"CREATE TABLE `orders` (`orderNumber`, `orderDa..."
5,table,productlines,productlines,46,"CREATE TABLE `productlines` (`productLine`, `t..."
6,table,products,products,47,"CREATE TABLE `products` (`productCode`, `produ..."
7,table,employees,employees,56,"CREATE TABLE `employees` (`employeeNumber`, `l..."

## Part 1: Join and Filter

### Step 1

The company would like to let Boston employees go remote but need to know more information about who is working in that office. Return the first and last names and the job titles for all employees in Boston.

In [2]:
# CodeGrade step1
# Replace None with your code
df_boston = """
SELECT firstName, lastName, jobTitle
FROM employees
JOIN offices ON employees.officeCode = offices.officeCode
WHERE city = 'Boston'
;
"""
pd.read_sql(df_boston, conn)

  firstName   lastName   jobTitle
0     Julie   Firrelli  Sales Rep
1     Steve  Patterson  Sales Rep

### Step 2

Recent downsizing and employee attrition have caused some mixups in office tracking and the company is worried they are supporting a 'ghost' location. Are there any offices that have zero employees?

In [9]:
# CodeGrade step2
# Replace None with your code
df_zero_emp = pd.read_sql( """
SELECT
    offices.officeCode,
    offices.city,
    COUNT(employees.employeeNumber) AS num_employees
FROM offices
LEFT JOIN employees ON offices.officeCode = employees.officeCode
GROUP BY offices.officeCode
ORDER BY num_employees;
""", conn)

df_zero_emp

  officeCode           city  num_employees
0          2         Boston              2
1          3            NYC              2
2          5          Tokyo              2
3          7         London              2
4          6         Sydney              4
5          4          Paris              5
6          1  San Francisco              6

## Part 2: Type of Join

### Step 3

As a part of this larger analysis project the HR department is taking the time to audit employee records to make sure nothing is out of place and have asked you to produce a report of all employees. Return the employees first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [10]:
# CodeGrade step3
# Replace None with your code
df_employee = pd.read_sql("""
SELECT 
    employees.firstName,
    employees.lastName,
    offices.city,
    offices.state
FROM employees
LEFT JOIN offices ON employees.officeCode = offices.officeCode
ORDER BY employees.firstName, employees.lastName;
""", conn)
df_employee

   firstName   lastName           city       state
0       Andy     Fixter         Sydney
1    Anthony        Bow  San Francisco          CA
2      Barry      Jones         London
3      Diane     Murphy  San Francisco          CA
4   Foon Yue      Tseng            NYC          NY
5     George     Vanauf            NYC          NY
6     Gerard     Bondur          Paris
7     Gerard  Hernandez          Paris
8       Jeff   Firrelli  San Francisco          CA
9      Julie   Firrelli         Boston          MA
10     Larry       Bott         London
11    Leslie   Jennings  San Francisco          CA
12    Leslie   Thompson  San Francisco          CA
13      Loui     Bondur          Paris
14      Mami      Nishi          Tokyo  Chiyoda-Ku
15    Martin     Gerard          Paris
16      Mary  Patterson  San Francisco          CA
17    Pamela   Castillo          Paris
18     Peter      Marsh         Sydney
19     Steve  Patterson         Boston          MA
20       Tom       King         Sydney
21   William  Patterson         Sydney
22   Yoshimi       Kato          Tokyo  Chiyoda-Ku

### Step 4
The customer management and sales rep team know that they have several 'customers' in the system that have not placed any orders. They want to reach out to these customers with updated product catalogs to try and get them to place initial orders. Return all of the customer's contact information (first name, last name, and phone number) as well as their sales rep's employee number for any customer that has not placed an order. Sort the results alphabetically based on the contact's last name

There are several approaches you could take here, including a left join and filtering on null values or using a subquery to filter out customers who do have orders. In total there are 24 customers who have not placed an order.

In [11]:
# CodeGrade step4
# Replace None with your code
df_contacts = pd.read_sql("""
SELECT 
    customers.contactfirstName,
    customers.contactlastName,
    customers.phone,
    customers.salesRepemployeeNumber
FROM customers
LEFT JOIN orders USING(customerNumber)
WHERE orders.orderNumber IS NULL
ORDER BY customers.contactlastName;
""", conn)
df_contacts

   contactFirstName  contactLastName             phone salesRepEmployeeNumber
0            Raanan      Altagar,G M  + 972 9 959 8555
1               Mel         Andersen       030-0074555
2            Carmen            Anton    +34 913 728555
3        Alejandra            Camino     (91) 745 6555
4           Philip            Cramer        0555-09555
5        Alexander             Feuer       0342-555176
6             Keith           Franco        2035557845                   1286
7            Peter           Franken       089-0877555
8                Ed         Harrison  +41 26 425 50 01
9             Karin          Josephs       0251-555259
10           Horst             Kloss       0372-555188
11           Armand            Kuger   +27 21 550 3555
12        Patricia           McKenna          2967 555
13          Renate           Messner       069-0555984
14           Hanna              Moos        0621-08555
15            Rita            Müller       0711-555361
16            Sven           Ottlieb       0241-039123
17         Zbyszek   Piestrzeniewicz     (26) 642-7555
18            Lino         Rodriguez      (1) 354-2555
19          Bradley         Schuyler   +31 20 491 9555
20       Alexander           Semenov   +7 812 293 0521
21            Braun              Urs       0452-076555                   1702
22           Brydey           Walker    +612 9411 1555
23          Isabel         de Castro      (1) 356-5555

## Part 3: Built-in Function

### Step 5

The accounting team is auditing their figures and wants to make sure all customer payments are in alignment, they have asked you to produce a report of all the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. They have asked that these results be sorted in descending order by the payment amount.

Hint: A member of their team mentioned that they are not sure the 'amount' column is being stored as the right datatype so keep this in mind when sorting.

In [15]:
# CodeGrade step5
# Replace None with your code
df_payment = pd.read_sql("""
SELECT 
    
    customers.contactfirstName,
    customers.contactlastName,
    payments.amount,
   payments.paymentDate
FROM customers
JOIN payments ON customers.customerNumber = payments.customerNumber
ORDER BY CAST(payments.amount AS REAL) DESC;
""", conn)

df_payment

    contactFirstName contactLastName     amount paymentDate
0             Diego           Freyre  120166.58  2005-03-18
1             Diego           Freyre  116208.40  2004-12-31
2              Susan          Nelson  111654.40  2003-08-15
3               Eric       Natividad  105743.00  2003-12-26
4              Susan          Nelson  101244.59  2005-03-05
..               ...             ...        ...         ...
268          Carine          Schmitt    1676.14  2004-12-18
269         Pascale         Cartrain    1627.56  2003-04-19
270           Jonas       Bergulfsen    1491.38  2003-10-28
271         Pascale         Cartrain    1128.20  2003-08-22
272            Akiko       Shimamura     615.45  2005-05-18

[273 rows x 4 columns]

## Part 4: Joining and Grouping

### Step 6

The sales rep team has noticed several key team members that stand out as having trustworthy business relations with their customers, reflected by high credit limits indicating more potential for orders. The team wants you to identify these 4 individuals. Return the employee number, first name, last name, and number of customers for employees whose customers have an average credit limit over 90k. Sort by number of customers from high to low.

In [17]:
# CodeGrade step6
# Replace None with your code
df_credit = pd.read_sql("""
SELECT
    employees.employeeNumber,
    employees.firstname,
    employees.lastName,
    COUNT (customers.customerNumber) AS number_of_customer
FROM employees
JOIN customers ON employees.employeeNumber = customers.salesRepEmployeeNumber
GROUP BY employees.employeeNumber
HAVING AVG(customers.creditLimit) > 90000
ORDER BY number_of_customer DESC
LIMIT 4;
""", conn)
df_credit

  employeeNumber firstName   lastName  number_of_customer
0           1501     Larry       Bott                   8
1           1370    Gerard  Hernandez                   7
2           1165    Leslie   Jennings                   6
3           1612     Peter      Marsh                   5

### Step 7

The product team is looking to create new model kits and wants to know which current products are selling the most in order to get an idea of what is popular. Return the product name and count the number of orders for each product as a column named 'numorders'. Also return a new column, 'totalunits', that sums up the total quantity of product sold (use the quantityOrdered column). Sort the results by the totalunits column, highest to lowest, to showcase the top selling products.

In [18]:
# CodeGrade step7
# Replace None with your code
df_product_sold = pd.read_sql("""
SELECT
    products.productName,
    COUNT(orderdetails.orderNumber) AS numbers,
    SUM(orderdetails.quantityOrdered) AS totalunits
FROM products
JOIN orderdetails USING (productCode)
GROUP BY products.productCode
ORDER BY totalunits DESC;
""", conn)
df_product_sold

                                 productName  numbers  totalunits
0                1992 Ferrari 360 Spider red       53        1808
1                       1937 Lincoln Berline       28        1111
2                  American Airlines: MD-11S       28        1085
3    1941 Chevrolet Special Deluxe Cabriolet       28        1076
4               1930 Buick Marquette Phaeton       28        1074
..                                       ...      ...         ...
104             1999 Indy 500 Monte Carlo SS       25         855
105                       1911 Ford Town Car       25         832
106         1936 Mercedes Benz 500k Roadster       25         824
107               1970 Chevy Chevelle SS 454       25         803
108                    1957 Ford Thunderbird       24         767

[109 rows x 3 columns]

## Part 5: Multiple Joins

### Step 8

As a follow-up to the above question, the product team also wants to know how many different customers ordered each product to get an idea of market reach. Return the product name, code, and the total number of customers who have ordered each product, aliased as 'numpurchasers'. Sort the results by the highest  number of purchasers.

Hint: You might need to join more than 2 tables. Use DISTINCT to return unique/different values.

In [20]:
# CodeGrade step8
# Replace None with your code
df_total_customers = pd.read_sql("""
SELECT
    products.productCode,
    products.productName,
    COUNT( DISTINCT orders.customerNumber) AS numpurchasers
FROM products
JOIN orderdetails USING (productCode)
JOIN orders USING (orderNUmber)
GROUP BY products.productCODE
ORDER BY numpurchasers DESC;
""", conn)
df_total_customers

    productCode                          productName  numpurchasers
0      S18_3232          1992 Ferrari 360 Spider red             40
1      S72_1253                     Boeing X-32A JSF             27
2      S18_2957                   1934 Ford V8 Coupe             27
3      S10_4757                  1972 Alfa Romeo GTA             27
4      S10_1949             1952 Alpine Renault 1300             27
..          ...                                  ...            ...
104    S24_2840  1958 Chevy Corvette Limited Edition             19
105    S24_3432                  2002 Chevy Corvette             18
106    S24_3191            1969 Chevrolet Camaro Z28             18
107    S24_2887                    1952 Citroen-15CV             18
108    S24_2766                   1949 Jaguar XK 120             18

[109 rows x 3 columns]

### Step 9

The custom relations team is worried they are not staffing locations properly to account for customer volume. They want to know how many customers there are per office. Return the count as a column named 'n_customers'. Also return the office code and city.

In [22]:
# CodeGrade step9
# Replace None with your code
df_customers = pd.read_sql("""
SELECT 
    offices.officeCode,
    offices.city,
    COUNT(customers.customerNumber) AS n_customers
FROM offices
JOIN employees ON offices.officeCode = employees.officeCode
JOIN customers ON employees.employeeNumber = customers.salesRepEmployeeNumber
GROUP BY offices.officeCode, offices.city
ORDER BY n_customers DESC;
""", conn)
df_customers

  officeCode           city  n_customers
0          4          Paris           29
1          7         London           17
2          3            NYC           15
3          1  San Francisco           12
4          2         Boston           12
5          6         Sydney           10
6          5          Tokyo            5

## Part 6: Subquery

### Step 10

Having looked at the results from above, the product team is curious to dig into the underperforming products. They want to ask members of the team who have sold these products about what kind of messaging was successful in getting a customer to buy these specific products. Using a subquery or common table expression (CTE), select the employee number, first name, last name, city of the office, and the office code for employees who sold products that have been ordered by fewer than 20 customers.

Hint: Start with the subquery, find all the products that have been ordered by 19 or less customers, consider adapting one of your previous queries.

In [30]:
# CodeGrade step10
# Replace None with your code
df_under_20 = pd.read_sql("""

SELECT 
    employees.employeeNumber,
    employees.firstName,
    employees.lastName,
    offices.city,
    offices.officeCode
FROM employees
JOIN offices ON employees.officeCode = offices.officeCode
WHERE employees.employeeNumber IN (
    SELECT customers.salesRepEmployeeNumber
    FROM orderdetails
    JOIN orders USING (OrderNumber)
    JOIN customers USING (customerNumber)
    WHERE orderdetails.productCode IN (
        SELECT productCode
        FROM orderdetails
        JOIN orders USING (orderNumber)
        GROUP BY productCode
        HAVING COUNT(DISTINCT orders.customerNumber) < 20
    )
)
GROUP BY employees.employeeNumber;
""", conn)
df_under_20

   employeeNumber firstName   lastName           city officeCode
0            1165    Leslie   Jennings  San Francisco          1
1            1166    Leslie   Thompson  San Francisco          1
2            1188     Julie   Firrelli         Boston          2
3            1216     Steve  Patterson         Boston          2
4            1286  Foon Yue      Tseng            NYC          3
5            1323    George     Vanauf            NYC          3
6            1337      Loui     Bondur          Paris          4
7            1370    Gerard  Hernandez          Paris          4
8            1401    Pamela   Castillo          Paris          4
9            1501     Larry       Bott         London          7
10           1504     Barry      Jones         London          7
11           1611      Andy     Fixter         Sydney          6
12           1612     Peter      Marsh         Sydney          6
13           1621      Mami      Nishi          Tokyo          5
14           1702    Martin     Gerard          Paris          4

### Close the connection

In [32]:
# Run this cell without changes

conn.close()